In [31]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [32]:
%sql sqlite:///first-database-sql.db

# Aggregation Fonksiyonları: Temel İstatistiksel islemler

In [33]:
%%sql
SELECT * FROM Products LIMIT 10;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31)]

### MIN / MAX;

In [11]:
%%sql
SELECT MIN(Price) AS min_Price FROM Products;

 * sqlite:///first-database-sql.db
Done.

[(6,)]

In [12]:
%%sql
SELECT MAX(Price) AS max_Price FROM Products;

 * sqlite:///first-database-sql.db
Done.

[(435,)]

In [13]:
%%sql
SELECT MAX(Price) AS max_Price, MIN(Price) AS min_Price FROM Products;

 * sqlite:///first-database-sql.db
Done.

[(435, 6)]

### ORTALAMA;

In [14]:
%%sql
SELECT AVG(Price) FROM Products;

 * sqlite:///first-database-sql.db
Done.

[(39.15584415584416,)]

### SUM;

In [15]:
%%sql
SELECT SUM(Price) FROM Products;

 * sqlite:///first-database-sql.db
Done.

[(3015,)]

##### Özet İSTATİSTİK;

In [18]:
%%sql
SELECT COUNT(Price) AS count_Price,  MIN(Price) AS min_Price, MAX(Price) AS max_Price, AVG(Price) AS avg_Price, SUM(Price) AS sum_Price FROM Products;

 * sqlite:///first-database-sql.db
Done.

[(77, 6, 435, 39.15584415584416, 3015)]

### GROUP BY ve Aggregation Fonksiyonları;

#### Kategorik degiskenlerin siniflarinin frekanslarina erismek istiyorum;

In [20]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

Hangi ulkeden kac tane musterim var?

In [25]:
%%sql
SELECT COUNT(CustomerID) AS Musteri_Sayisi FROM Customers GROUP BY Country ORDER BY Musteri_Sayisi LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1,), (1,), (1,), (2,), (2,)]

In [26]:
%%sql
SELECT COUNT(CustomerID) AS Musteri_Sayisi, Country FROM Customers GROUP BY Country ORDER BY Musteri_Sayisi LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Ireland'), (1, 'Norway'), (1, 'Poland'), (2, 'Austria'), (2, 'Belgium')]

In [23]:
%%sql
SELECT COUNT(CustomerID) AS Musteri_Sayisi, Country FROM Customers GROUP BY Country ORDER BY Musteri_Sayisi DESC LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(13, 'USA'), (11, 'Germany'), (11, 'France'), (9, 'Brazil'), (7, 'UK')]

#### Sürekli degiskenlerde islem yapmak istersem;

Kategorilerin fiyat ortalaması nedir?

In [28]:
%%sql 
SELECT AVG(Price) AS ort_Price, CategoryID FROM Products GROUP BY CategoryID ORDER BY Price;

 * sqlite:///first-database-sql.db
Done.

[(28.25, 2),
 (33.76923076923077, 3),
 (42.75, 1),
 (74.9, 4),
 (23.571428571428573, 5),
 (32.2, 7),
 (26.5, 8),
 (55.166666666666664, 6)]

In [29]:
%%sql 
SELECT AVG(Price) AS ort_Price, CategoryID FROM Products GROUP BY CategoryID ORDER BY Price DESC;

 * sqlite:///first-database-sql.db
Done.

[(55.166666666666664, 6),
 (26.5, 8),
 (32.2, 7),
 (23.571428571428573, 5),
 (74.9, 4),
 (42.75, 1),
 (33.76923076923077, 3),
 (28.25, 2)]

In [30]:
%%sql 
SELECT AVG(Price) AS ort_Price, CategoryID FROM Products GROUP BY CategoryID ORDER BY CategoryID;

 * sqlite:///first-database-sql.db
Done.

[(42.75, 1),
 (28.25, 2),
 (33.76923076923077, 3),
 (74.9, 4),
 (23.571428571428573, 5),
 (55.166666666666664, 6),
 (32.2, 7),
 (26.5, 8)]